7.1 Handling Missing Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
float_data=pd.Series([1.2,-3.5,np.nan,0])

In [4]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data=pd.Series([
    "aardvark",np.nan,None,"avocado"
])

In [7]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [8]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [9]:
float_data=pd.Series([1,2,None],dtype="float64")

In [10]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [11]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

## Table 7-1. NA handling object methods

| Method   | Description                                                                 | Example (Python) | Output |
|----------|-----------------------------------------------------------------------------|------------------|--------|
| `dropna` | Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate | `pd.Series([1, np.nan, 3]).dropna()` | `[1.0, 3.0]` |
| `fillna` | Fill in missing data with some value or using an interpolation method such as `"ffill"` or `"bfill"` | `pd.Series([1, np.nan, 3]).fillna(0)` | `[1.0, 0.0, 3.0]` |
| `isna`   | Return Boolean values indicating which values are missing/NA                | `pd.Series([1, np.nan, 3]).isna()` | `[False, True, False]` |
| `notna`  | Negation of `isna`, returns True for non-NA values and False for NA values  | `pd.Series([1, np.nan, 3]).notna()` | `[True, False, True]` |

Filtering Out Missing Data

In [12]:
data=pd.Series(
    [
        1,np.nan,3.5,np.nan,7
    ]
)

In [13]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [14]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],                   
[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

Passing how="all" will drop only rows that are all NA:

In [18]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4]=np.nan

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

To drop columns in the same way, pass axis="columns":

In [21]:
data.dropna(axis="columns",how="all") # use rows instead of columns

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df=pd.DataFrame(np.random.standard_normal((7,3)))

In [23]:
df

          0         1         2
0  1.217565  0.603590  0.838494
1 -0.119550 -2.342930  1.054814
2 -0.660550  1.040334  1.097837
3  0.221481 -0.127133 -0.575027
4  0.356558 -0.187517 -0.260789
5 -0.076458  0.451745 -1.740658
6  0.655369 -0.796971 -1.271566

In [24]:
df.iloc[:4:1]=np.nan

In [25]:
df.iloc[:2,2]=np.nan

In [26]:
df

          0         1         2
0       NaN       NaN       NaN
1       NaN       NaN       NaN
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4  0.356558 -0.187517 -0.260789
5 -0.076458  0.451745 -1.740658
6  0.655369 -0.796971 -1.271566

In [27]:
df.dropna()

          0         1         2
4  0.356558 -0.187517 -0.260789
5 -0.076458  0.451745 -1.740658
6  0.655369 -0.796971 -1.271566

thresh=2 â†’ Sets a threshold: a row must have at least 2 non-NaN values to be kept.

If a row has fewer than 2 non-null entries, it will be dropped.

In [28]:
df.dropna(thresh=2)

          0         1         2
4  0.356558 -0.187517 -0.260789
5 -0.076458  0.451745 -1.740658
6  0.655369 -0.796971 -1.271566

# Filling In Missing Data

In [29]:
df.fillna(0)

          0         1         2
0  0.000000  0.000000  0.000000
1  0.000000  0.000000  0.000000
2  0.000000  0.000000  0.000000
3  0.000000  0.000000  0.000000
4  0.356558 -0.187517 -0.260789
5 -0.076458  0.451745 -1.740658
6  0.655369 -0.796971 -1.271566

In [30]:
df.fillna(
    {1:0.5,2:0}
)

          0         1         2
0       NaN  0.500000  0.000000
1       NaN  0.500000  0.000000
2       NaN  0.500000  0.000000
3       NaN  0.500000  0.000000
4  0.356558 -0.187517 -0.260789
5 -0.076458  0.451745 -1.740658
6  0.655369 -0.796971 -1.271566

In [31]:
df=pd.DataFrame(np.random.standard_normal((6,3)))

In [32]:
df

          0         1         2
0  0.796679 -0.345025 -1.825701
1  1.009427  1.041310 -0.128338
2 -0.511743 -1.926985  1.260908
3  0.304825  0.732156  0.866788
4 -0.478738 -1.527161  0.695577
5 -0.423835  0.671577  1.197358

In [33]:
df.iloc[2:,1]=np.nan

In [34]:
df.iloc[4:,2]=np.nan

In [35]:
df

          0         1         2
0  0.796679 -0.345025 -1.825701
1  1.009427  1.041310 -0.128338
2 -0.511743       NaN  1.260908
3  0.304825       NaN  0.866788
4 -0.478738       NaN       NaN
5 -0.423835       NaN       NaN

In [36]:
df.fillna(method="ffill")

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_15812\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.796679 -0.345025 -1.825701
1  1.009427  1.041310 -0.128338
2 -0.511743  1.041310  1.260908
3  0.304825  1.041310  0.866788
4 -0.478738  1.041310  0.866788
5 -0.423835  1.041310  0.866788

In [37]:
df.fillna(method="ffill",limit=2)

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_15812\3768739427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=2)

          0         1         2
0  0.796679 -0.345025 -1.825701
1  1.009427  1.041310 -0.128338
2 -0.511743  1.041310  1.260908
3  0.304825  1.041310  0.866788
4 -0.478738       NaN  0.866788
5 -0.423835       NaN  0.866788

In [38]:
data=pd.Series(
    [1.,np.nan,3.5,np.nan,7]
)

In [39]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [40]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Table 7-2. `fillna` function arguments

| Argument | Description                                                                 | Example (Python) | Output |
|----------|-----------------------------------------------------------------------------|------------------|--------|
| `value`  | Scalar value or dictionary-like object to use to fill missing values        | `pd.Series([1, np.nan, 3]).fillna(value=0)` | `[1.0, 0.0, 3.0]` |
| `method` | Interpolation method: `"bfill"` (backward fill) or `"ffill"` (forward fill); default is `None` | `pd.Series([1, np.nan, np.nan, 4]).fillna(method="ffill")` | `[1.0, 1.0, 1.0, 4.0]` |
| `axis`   | Axis to fill on (`"index"` or `"columns"`); default is `"index"`            | `df.fillna(method="ffill", axis="columns")` | Missing values filled column-wise |
| `limit`  | For forward/backward filling, maximum number of consecutive periods to fill | `pd.Series([1, np.nan, np.nan, 4]).fillna(method="ffill", limit=1)` | `[1.0, 1.0, NaN, 4.0]` |

# 7.2 Data Transformation

Removing Duplicates

In [41]:
data=pd.DataFrame({
    "k1":["one","two"]*3+["two"],
    "k2":[1,1,2,3,3,4,4]
})

In [42]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [43]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [44]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [45]:
data["v1"]=range(7)

In [46]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [47]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [48]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [49]:
data.drop_duplicates(["k1", "k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

Transforming Data Using a Function or Mapping

In [50]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                             "pastrami", "corned beef", "bacon",
                             "pastrami", "honey ham", "nova lox"],
                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [51]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [52]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [53]:
data["animal"]=data["food"].map(meat_to_animal)

In [54]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [55]:
def get_animal(x):
    return meat_to_animal[x]

In [56]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Replacing Values

In [57]:
data=pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [58]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [61]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

Renaming Axis Indexes

In [62]:
data=pd.DataFrame(
    np.arange(12).reshape((3,4)),
    index=["Ohio","Colorado","New York"],
    columns=["one","two","three","four"]
)

In [63]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [64]:
def transform(x):
    return x[:4].upper()

In [65]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [66]:
data.index=data.index.map(transform)

In [67]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [68]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [69]:
data.rename(
    index={"OHIO":"INDIANA"},
    columns={"three":"peekaboo"}
)

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

# Discretization and Binning

In [70]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [71]:
bins=[18, 25, 35, 60, 100]

In [72]:
age_catgeories=pd.cut(ages,bins)

In [73]:
age_catgeories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [74]:
age_catgeories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [75]:
age_catgeories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [76]:
age_catgeories.categories[0]

Interval(18, 25, closed='right')

In [77]:
pd.value_counts(age_catgeories)

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_15812\3827431093.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_catgeories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [78]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [79]:
group_names=["Youth","YoungAdult","MiddleAged","Senior"]

In [80]:
pd.cut(ages,bins,labels=group_names)
data1=pd.cut(ages,bins,labels=group_names)

In [81]:
data1.value_counts()

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
Name: count, dtype: int64

In [82]:
data=np.random.uniform(size=20)

In [83]:
data

array([0.59060699, 0.03711806, 0.7268219 , 0.7636184 , 0.00617176,
       0.63677817, 0.34879068, 0.38358527, 0.99431134, 0.37182939,
       0.71399813, 0.71232119, 0.41225645, 0.34002366, 0.91946729,
       0.26833609, 0.34088206, 0.10610435, 0.54186798, 0.59056927])

In [84]:
pd.cut(data,4,precision=2)

[(0.5, 0.75], (0.0052, 0.25], (0.5, 0.75], (0.75, 0.99], (0.0052, 0.25], ..., (0.25, 0.5], (0.25, 0.5], (0.0052, 0.25], (0.5, 0.75], (0.5, 0.75]]
Length: 20
Categories (4, interval[float64, right]): [(0.0052, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

In [85]:
data=np.random.standard_normal(1000)

In [86]:
data

array([ 1.78141404e-01,  1.85543336e+00, -1.14350600e+00, -1.27511330e-01,
       -5.54524200e-01, -1.22902663e+00,  1.96655751e+00, -1.31020263e+00,
       -6.41485080e-01, -7.40828034e-01,  1.51422332e+00,  1.09098447e+00,
       -2.05898321e+00, -4.68417603e-01,  1.36263838e+00, -1.60958389e+00,
        2.61836186e-01, -6.54108369e-01, -6.90982184e-01,  9.24116770e-02,
        1.74021802e-01,  3.25242219e-01, -3.05780219e-01,  6.94597362e-02,
       -5.25297345e-01,  7.15905732e-01,  5.72601552e-01, -7.83935970e-01,
        2.04533028e+00, -2.92977982e-02,  1.02918157e+00,  1.27054171e+00,
       -1.04470743e+00, -1.12214900e+00,  1.86711414e-01,  3.80852966e-01,
        4.15757418e-01, -1.52035478e+00,  9.05115520e-02, -1.09397510e+00,
       -2.42386789e-01,  1.77534886e+00, -1.44388822e+00, -2.35628718e+00,
        2.83891694e-01, -4.66763949e-01, -6.54890850e-01, -1.18631798e+00,
        1.15119304e+00, -7.51916228e-02,  1.58312699e+00, -3.86968589e-01,
       -5.41138441e-01,  7.86800228e-01,  5.44788749e-01, -3.14823266e-01,
       -1.66789706e+00,  7.34162296e-01,  1.55380886e+00, -2.97103870e-01,
       -6.11785456e-02, -2.27919169e+00,  3.68416902e-01, -9.51336832e-01,
       -1.33984229e+00,  2.04893658e-01,  6.50817457e-01,  4.24229941e-01,
        4.20900217e-02, -1.65751444e+00, -3.24510898e-01, -6.78603859e-02,
       -1.93090976e-01,  9.51648851e-01, -2.00580328e-01,  1.01359790e+00,
       -1.88405121e-01,  2.71474842e-01,  1.65019156e+00, -6.70039354e-01,
        2.54795314e-01,  1.52561280e-02, -3.25291233e-01, -3.80829496e-01,
        9.78577859e-02, -5.90513056e-01, -1.30546985e-01,  1.48932815e+00,
        5.37269024e-01,  8.85929189e-01,  8.34685085e-01,  1.10021886e-02,
        2.11266885e+00,  4.37701940e-01, -6.40584774e-01,  3.75070718e-01,
        5.46904456e-01, -8.54217095e-01, -7.41844452e-01, -8.68051424e-01,
       -1.97597497e+00, -1.37444803e-01, -1.48596262e-01, -5.28904196e-01,
        7.32670436e-02,  3.69382929e-01,  4.70326469e-01,  2.50182629e+00,
       -2.88429317e+00,  6.94661657e-01, -1.83526420e-01, -1.31661255e+00,
        5.24452540e-01, -1.54642436e+00, -1.85892919e-01,  5.43807842e-01,
       -2.32884998e-01, -4.65090551e-01, -2.87397702e-01, -4.90048774e-01,
       -5.59902761e-01,  3.37885032e-01,  7.38447840e-01, -6.84623662e-01,
        1.29022075e+00,  1.31998829e+00, -6.96319043e-02, -2.83501661e-01,
       -1.62188005e-01, -6.32935468e-01, -6.36097474e-01, -2.28908394e+00,
       -1.15005417e-01, -1.31087985e+00,  6.15229974e-01,  3.04971497e-02,
        1.03196526e+00, -2.02541990e+00,  2.31030531e-02, -2.68551178e-01,
       -1.62645539e+00, -1.12742194e+00,  1.86165423e+00,  4.92534576e-01,
       -9.33936724e-01, -7.52861443e-02,  1.44359764e+00, -9.27512257e-01,
       -2.14868731e-01,  8.82373078e-01, -9.64704456e-01, -4.78443812e-01,
        9.91505725e-01,  2.73506641e-01, -2.69709523e-01,  5.07409390e-01,
       -1.44345425e+00, -1.95799979e+00,  1.41357942e-01, -6.57381025e-01,
        1.65041033e-01, -5.74683972e-01,  1.28020207e-01,  7.00450126e-01,
       -6.56815924e-01,  1.91973252e-01,  3.18297137e-01, -1.27191263e+00,
        3.90531688e-01, -1.38514989e+00,  2.31788615e+00,  8.82932851e-01,
       -1.09188170e+00, -2.71062350e-01,  9.34398853e-01, -1.04220932e+00,
       -1.31071517e+00, -1.81473055e+00, -1.00631355e+00,  1.60812021e+00,
       -8.59745870e-01,  1.29342972e-01, -1.29732440e-01,  6.91891325e-01,
        1.12183822e+00, -8.37540077e-01,  2.30180330e+00,  5.92930119e-02,
        2.91570971e-01,  8.43050684e-03,  1.03136702e+00,  5.45408291e-01,
       -1.52727778e+00,  5.34241730e-01, -4.46409993e-01, -1.68017063e-01,
       -1.34727872e-01, -1.53777609e+00, -7.59823578e-01,  7.20278614e-01,
        9.84903380e-01,  2.02291007e+00,  3.99758217e-02, -5.27976477e-02,
       -8.09117925e-01, -2.00543228e-01,  7.67259222e-01, -9.11282905e-01,
       -8.12882706e-01, -5.09527615e-01,  1.17472867e+00, -2.39089727e-01,
        4.63882175e-01,  6.18112370e-02,  5.19009116e-01, -2.70153660e-01,
        3.86928098e-02, -1.64581600e+00, -7.03579153e-01,  9.76143143e-01,
        1.68778835e+00,  1.73737392e+00,  5.95937381e-01, -8.77257117e-01,
       -1.06787623e+00,  4.03918334e-02,  9.40748754e-01,  8.30309005e-01,
       -2.90540653e-01,  1.55020370e+00,  5.03803990e-02, -6.72703664e-01,
       -6.97164122e-01,  4.26191299e-01, -1.30043226e-02,  3.62304644e-01,
       -8.07642256e-02,  8.55164678e-01, -2.17091126e-01, -1.87309308e+00,
        8.77846212e-01,  1.72223085e+00, -1.02611842e+00,  2.26263326e-01,
        2.81779503e-01, -3.11729213e-01,  2.05422554e-01,  2.21100234e-01,
        8.97253759e-02,  1.43860174e+00, -4.73471947e-01,  1.12042856e+00,
       -1.35950307e+00, -8.78878839e-02, -3.57598023e-02, -8.51450379e-01,
        2.78933611e-01,  4.23176449e-01,  1.22534332e-01, -1.28831079e-01,
        5.14686785e-02, -1.65640098e+00,  3.20736936e-01, -7.12166878e-01,
       -1.16807560e+00,  9.86636952e-02,  1.18626487e+00, -2.11685645e-01,
        6.34381492e-01, -2.12973621e+00, -9.16539798e-02,  1.66048845e+00,
        2.99085523e-01,  1.75271628e-01, -1.57743489e-01,  7.71317146e-01,
       -1.80486590e+00,  7.33516643e-01, -1.96584633e-01, -1.19951558e+00,
       -9.10848954e-02, -8.95687629e-01,  4.01824369e-01, -6.77788800e-01,
        9.93187875e-03, -2.96453664e-02, -8.35400712e-01,  5.25150388e-01,
        6.65971335e-01,  8.37811798e-01,  1.97918439e-01,  1.26526966e+00,
       -9.70897496e-01,  1.89079852e+00,  1.54459506e+00, -1.11492150e+00,
       -7.27484522e-01,  7.19046011e-01,  6.22506634e-01,  1.04402570e+00,
       -2.92305632e-01,  4.86351072e-01, -1.12213812e+00,  3.65539751e-01,
        6.57276106e-01, -1.88539341e+00, -7.84624449e-02,  1.30669880e+00,
       -6.96354991e-01, -1.26189847e+00, -3.66606144e-01, -1.55252295e-01,
        8.07026530e-01, -7.52999028e-01,  7.19413639e-01,  1.14458540e+00,
       -2.22663594e-01, -2.69500759e+00,  6.45895342e-01,  1.47962798e-01,
       -3.54951296e-01, -1.17150915e+00,  7.90422939e-01,  8.49277246e-01,
       -1.10711099e+00, -8.21261946e-02, -2.05114902e+00,  1.06593893e+00,
        1.55581382e+00, -9.11916413e-01,  6.39328250e-02, -1.20764573e+00,
       -1.93999035e+00, -7.10378187e-01,  7.54232012e-01,  2.14839620e+00,
        1.40249551e+00, -7.56137089e-01,  4.57549706e-01, -9.93483782e-01,
       -1.72963091e-01, -6.05047316e-01, -1.22813787e+00, -5.91758086e-01,
       -9.38863711e-01, -1.20644415e+00, -3.16531444e-01,  7.16838468e-01,
       -9.68404532e-01,  8.94054354e-01,  2.84732141e+00, -4.03941667e-01,
        1.94135434e+00, -3.31705127e-01,  1.39663469e+00, -2.40412573e-02,
        9.48949990e-01, -1.34976208e+00,  1.44922208e+00,  5.98730657e-01,
       -2.94769786e-01, -8.53619814e-01, -1.72418097e-01, -4.82624976e-01,
        4.97315502e-01,  2.75918671e-01, -9.88442171e-01, -8.46793460e-01,
        6.96763524e-01,  7.10647376e-01,  3.82166428e-01, -1.07291893e+00,
        2.43732829e-01,  1.25056798e-01,  8.88304471e-01, -1.27331884e+00,
       -1.07262000e+00,  1.62116190e+00,  5.61475562e-01,  1.31821554e+00,
        5.98633282e-01,  3.25267116e-01, -9.49547234e-01,  7.64291422e-01,
       -3.28956695e-01, -4.66769873e-01, -5.18054598e-01,  7.06580128e-01,
       -2.93248654e-01,  1.30495907e+00,  6.74347761e-01, -1.05547620e-01,
        1.30738776e+00, -1.03327806e+00, -1.08904994e+00,  8.73955061e-01,
        2.94184025e-01,  6.86064778e-01, -9.14453707e-01,  3.89941987e-01,
        1.18080318e+00, -1.03648124e+00, -9.34023367e-01, -2.94868242e-01,
        1.92641640e+00,  4.90060112e-01, -4.25571741e-01,  1.95907767e-01,
       -1.77210121e-02,  1.55904479e-01,  6.24864263e-01,  5.46667349e-01,
        6.56191153e-01, -8.29922306e-01, -5.59450016e-01, -6.80384707e-01,
        6.20525625e-02, -2.69039931e-01,  2.05635695e+00,  4.15097058e-02,
       -1.20571287e+00, -3.96285825e-01, -1.68307298e+00, -1.17034558e+00,
        4.98015317e-01, -1.61713215e+00, -1.35300201e+00, -6.53611461e-02,
       -1.74412532e+00, -8.89586522e-01,  2.19499312e-01, -1.29348043e+00,
       -9.81339326e-01,  2.48170084e-01, -6.01412025e-01, -4.44620529e-01,
       -6.43438644e-01,  4.39942485e-01,  2.19711163e+00,  6.60463878e-01,
       -6.69517554e-01,  2.32315171e-01,  9.74956157e-01,  9.60449702e-01,
        1.70175072e+00,  3.24115857e-01,  5.74024823e-01,  9.26559561e-01,
        1.54753908e-01, -2.01659641e-01, -2.42970354e-02, -9.24155921e-01,
        4.16875330e-01,  6.05169735e-01, -7.68705059e-01,  5.23489443e-02,
       -4.85309256e-01,  4.17620429e-01, -4.60265000e-01, -2.98789967e-01,
        1.22127179e+00, -1.17040501e+00, -1.31293167e+00, -6.38481760e-01,
       -4.71841403e-01, -1.51037541e+00,  3.95428208e-01, -1.24860073e-01,
       -4.13438785e-01, -5.63029264e-01,  8.07017766e-01, -7.61655188e-01,
       -2.41898720e-01, -2.41122109e-01, -4.64890557e-01,  2.37148154e+00,
        1.51605537e+00, -6.55285037e-01, -7.14632503e-01,  6.23507091e-01,
       -1.00706483e+00, -2.50686986e-01, -8.48686601e-01,  4.80215787e-01,
       -8.97120846e-01, -1.44935715e+00, -7.99947817e-01,  7.25291917e-02,
       -1.18185178e+00,  3.60553044e-01, -1.29329852e-01,  5.03041095e-01,
       -6.14336801e-01,  2.17671649e-01, -6.27971353e-03,  3.53820359e-01,
       -2.11794402e-01, -6.26475696e-01,  8.60369569e-01, -1.19534870e-01,
       -1.45899354e+00, -4.57806695e-01, -6.87211730e-01, -5.88937421e-01,
       -2.54616559e-01,  1.96615039e+00,  7.47036092e-02, -4.72375564e-01,
       -2.58549903e-01,  2.58759369e-01,  1.26463983e+00,  2.37430400e-01,
        3.78757143e-01,  1.51104953e+00,  4.28593163e-01,  1.32440569e+00,
        2.26711984e-01,  4.01163839e-01,  2.76304240e-01, -1.47778703e+00,
        5.59459204e-01,  1.65444907e-02,  1.95626731e-01,  2.13466752e-01,
        3.07940380e-01,  6.11789844e-01, -5.78572347e-02, -7.77384613e-01,
        3.60615042e-01, -8.27264418e-01,  1.09992673e+00, -2.56846885e+00,
       -6.58283162e-01,  2.05950300e-01, -3.26370713e-01,  7.73926382e-01,
       -1.51761653e+00, -1.72862489e+00,  2.68557730e-01,  1.96383608e-01,
        2.59456267e-01,  7.86567823e-01, -9.05326262e-01, -6.83787507e-02,
       -1.16686863e+00,  2.96037781e-01,  5.67031600e-01, -1.11833494e+00,
       -9.46511884e-01, -1.22533996e+00, -5.53896195e-01,  2.51373934e-03,
       -7.90450354e-01,  2.03141894e-01,  2.66327882e-01,  3.85660215e-01,
        3.34834233e-01,  2.00444943e-01,  1.40017273e+00, -1.08063028e+00,
       -1.05074304e+00,  9.36528534e-01, -1.27686953e+00, -1.36268885e+00,
        1.02582849e+00, -5.34887266e-01,  1.36186468e+00,  1.21117997e-01,
       -1.51111692e-01, -1.73847063e+00, -4.24311150e-01,  9.20215004e-02,
       -7.76371613e-01,  7.59795196e-02,  8.26497109e-01, -3.56031691e-01,
        3.47766691e-01, -1.32453734e+00, -1.85286445e+00, -1.27793618e+00,
        1.15206534e+00, -6.25352773e-01,  1.97347494e-03, -6.21631705e-01,
        1.31075863e+00,  1.14978717e+00, -1.76224779e+00, -1.75562705e+00,
        6.77365933e-01,  2.11596090e-01, -1.14286866e+00, -6.81259617e-01,
        8.80524815e-01,  1.18904951e+00,  5.97674117e-01, -1.14473759e+00,
       -6.96806279e-01, -1.31732261e+00,  3.11172034e-02, -2.95998382e-01,
       -5.62869875e-02,  1.88703326e-01,  1.34936148e+00,  1.14361436e+00,
        1.34408065e+00, -9.29291862e-01,  1.92348226e+00,  1.16421615e+00,
       -7.76214741e-01, -3.55581163e-01, -6.75090687e-01,  1.26082386e-01,
        7.11657228e-01, -3.70571426e-01, -4.21178175e-01, -7.53216571e-01,
       -2.12595136e-01, -3.34372215e-02, -1.31937561e+00,  1.30128638e+00,
       -4.59871131e-01,  4.45559844e-01,  2.30715435e-01, -1.35289851e+00,
        1.46968150e+00,  4.72767359e-01,  9.72311501e-02,  5.01716123e-02,
       -6.48600905e-01, -5.93999496e-01,  1.27214441e+00,  5.06647842e-01,
        6.08390173e-01, -5.84425311e-01,  3.15136616e-01, -1.99319862e-01,
        1.36001752e+00, -3.84321100e-01, -6.50713799e-01, -1.77871905e+00,
       -6.94206212e-01, -2.81827972e-01, -1.13832810e+00, -9.86083164e-02,
       -6.45759476e-02,  1.59681894e+00,  1.41334938e+00, -7.56216554e-01,
       -3.02794483e-01,  1.33592180e+00,  1.06085797e+00,  6.74089729e-01,
       -1.91311862e+00, -4.74495186e-01,  6.21472950e-01,  2.39342322e+00,
       -7.59433465e-01,  5.59564383e-01,  1.40665723e-02,  6.36200238e-01,
        7.97610955e-01,  6.10567465e-01,  5.40142021e-01, -1.67768088e-01,
        5.06271451e-01, -2.28823625e+00,  1.04934124e+00,  8.22247040e-01,
        1.40942080e+00,  1.59425171e+00,  1.74576173e+00,  1.34901580e+00,
       -4.67790180e-01,  1.13053595e+00, -1.44460817e+00,  8.47833710e-01,
        1.19019870e+00,  1.02586587e+00,  9.78688603e-01,  9.68373605e-01,
       -1.03361265e+00, -1.63894071e-01,  3.54816017e-01,  1.27863117e+00,
        4.61171794e-02,  8.69737892e-01, -5.14926395e-01,  1.46411456e+00,
        4.67743197e-01,  1.18281622e+00, -1.08735636e+00, -6.26242517e-01,
       -4.53307420e-01, -1.89203667e+00,  1.98613871e-01,  1.20493111e+00,
       -8.41980038e-01,  7.69345687e-01,  1.92743577e-01,  7.49729134e-01,
        2.73608990e+00,  3.27271399e-01, -8.77613264e-01,  2.67474051e-01,
       -1.08685656e+00, -1.53012169e+00,  9.53660325e-01, -2.21119734e+00,
       -3.92037222e-01,  3.63724432e-02, -7.92917407e-01, -5.83197417e-01,
       -7.57997729e-01,  7.09965876e-01,  1.06784102e+00, -1.95632887e-01,
        5.91476847e-02,  1.26465634e+00,  5.56593119e-01,  1.14576463e+00,
       -7.72921710e-01, -1.61104925e+00,  5.40238988e-01,  9.62107703e-01,
        6.63460689e-01,  1.31611573e+00, -6.04829755e-01, -6.11607072e-01,
       -1.01666781e+00,  4.84364177e-01,  6.14120429e-01, -1.84352906e+00,
       -1.17391515e+00, -5.94905373e-01,  1.60250314e+00,  2.04082896e+00,
       -4.10635831e-02,  3.56192620e-01,  1.34269880e+00,  8.59947004e-02,
        1.06903580e+00,  5.40847318e-01,  8.90227088e-01,  3.43533289e-01,
       -1.24111142e+00, -3.62870854e-02,  7.27177660e-01, -7.79484357e-01,
       -6.81948246e-01, -1.33314930e+00, -1.22831880e+00,  1.74395878e+00,
        7.16870740e-01, -4.15505376e-01, -1.66719853e+00,  1.38984143e+00,
        8.43964492e-01, -4.90409137e-01,  7.87771291e-03, -1.37779032e+00,
       -2.00086516e+00,  1.22298846e+00,  2.86246735e+00, -5.82643190e-03,
       -1.79321897e+00, -5.57970940e-02,  1.30240216e+00, -5.00648928e-01,
        1.43387733e+00, -9.15814658e-01, -2.05610298e-02, -1.23643005e+00,
        8.68245474e-02, -1.37481153e-01,  3.29155686e-01, -1.42158030e-01,
        1.63937167e+00, -2.94898528e-01,  8.58860896e-01, -2.42512100e+00,
       -4.45409647e-02, -1.41028098e-01, -1.10834883e+00, -1.66640917e+00,
       -1.46996515e+00,  2.10702273e-01, -7.43924053e-01,  2.39257760e-02,
        9.98291740e-01,  9.76811705e-01, -9.76374290e-01, -1.18198066e+00,
        1.11442349e+00, -2.02721107e+00, -3.45932239e-01,  1.67361938e+00,
        1.46267649e-01, -5.31672916e-01,  8.22836386e-01, -9.71786756e-01,
       -1.91085800e-01,  1.15508306e+00, -3.30635442e-01, -1.15843748e+00,
       -3.50146214e-01,  1.72970972e+00,  4.41812999e-01,  7.07054156e-01,
        5.19405741e-01,  8.76060619e-01, -1.34310904e-02,  4.41050075e-01,
        3.16800881e-01, -1.74783175e+00,  7.68458435e-01,  1.68471741e+00,
        1.53428798e+00,  4.04203169e-01, -1.40804323e+00, -5.10160661e-01,
       -1.36871433e-01, -1.70259451e-01, -1.27470865e+00, -1.17093300e+00,
        2.37402371e-01,  1.10802345e+00,  1.41487282e+00,  3.28292319e-01,
        8.97179146e-02,  1.37093187e+00, -1.62650055e+00,  8.40920360e-01,
        5.48894460e-01, -2.59265483e-03, -1.18113912e+00,  1.37076029e+00,
        7.42479351e-01,  5.02414228e-01,  3.26005333e-01, -1.23366731e+00,
       -1.59008790e-03,  1.97862927e-01, -1.36824331e+00, -9.17848682e-02,
        7.47210560e-01,  1.14469693e+00, -1.28826664e+00,  1.90790491e-01,
        5.57444978e-01,  5.06674837e-01,  1.55396534e-01, -1.46685259e-01,
       -1.82758266e+00,  1.06051345e+00, -1.04832683e-02,  1.06570338e+00,
       -1.34619460e+00,  2.64782669e-01, -3.50176854e-01,  8.84270922e-01,
       -5.05211929e-01,  8.05370894e-01,  4.71408784e-01,  1.49504065e-01,
       -5.40049771e-01, -5.89489036e-01,  3.17586671e-01, -9.27260467e-01,
       -9.22109068e-01, -1.61470209e+00, -7.47376195e-02,  1.78641153e+00,
       -8.82845609e-01,  2.19669367e-01,  4.59502549e-01,  1.52051923e+00,
        3.80261478e-01, -1.72516020e-01, -1.30071380e+00, -3.18724892e-01,
        3.90377564e-01,  5.96099083e-01,  3.10105185e-01, -1.77928111e+00,
       -8.86521346e-01, -1.90859783e-01, -5.30477898e-01, -5.17483650e-01,
        1.83992006e-01,  7.19822692e-01,  8.14338289e-01, -1.87177721e-01,
       -1.04655849e+00,  1.52318955e+00, -5.39925064e-01,  5.91913398e-01,
        1.33880176e+00, -9.65753221e-02,  6.28641012e-01, -5.09885921e-01,
       -1.16741683e+00, -1.42686304e+00, -2.98360271e-01, -8.91682769e-01,
        1.09845334e+00, -6.49221845e-01,  1.11724352e+00, -1.71369469e+00,
        7.10809304e-01,  1.13530882e-01,  1.60525068e+00, -6.25966818e-01,
       -2.76699717e-01, -2.18482380e-01, -1.71030284e+00, -4.19639694e-01,
       -3.28301612e-01,  7.40494909e-02, -1.31546197e+00,  1.72058220e+00,
        6.58319571e-01, -2.82830290e-01,  3.11061996e-01,  2.98492910e-01,
        1.76617932e+00, -2.46229294e-01,  5.81140826e-01, -1.36720768e+00,
        2.66459686e-01, -6.90581201e-01, -1.80804148e+00,  1.20522138e+00,
       -1.35718340e+00,  3.70440219e-02,  7.53328181e-01,  3.20534951e-01,
       -8.41933274e-01,  3.90847377e-01, -4.71544374e-01,  5.81252477e-01,
        4.85696481e-01,  9.23633770e-01, -5.22829846e-01,  6.09880218e-01,
        6.52633353e-01, -2.89048789e-01,  3.75232256e-01, -1.85980476e-01,
        4.25249273e-01, -1.10195739e-01,  1.29225533e+00, -6.45459671e-01,
       -3.89095824e-01,  1.58801842e-01, -3.61448132e-01, -1.71098963e+00,
       -1.47072145e+00, -1.77578850e+00, -1.90439534e-01,  5.11113101e-02,
       -7.36434082e-01,  5.29696676e-01, -4.44469582e-01, -2.10035825e+00,
        2.35707540e-01,  9.46133260e-01, -9.59577320e-01, -1.90291663e+00,
        1.97953071e+00,  1.40933713e+00, -1.05724259e+00,  1.69151198e-01,
       -3.19148413e-01, -9.89891871e-02, -2.79441459e-01, -1.81761543e+00,
       -7.69803460e-01, -1.12791878e-01, -1.33128457e-01, -6.05273956e-02,
        9.27351926e-01,  7.30203148e-01,  2.45644393e-01, -6.10598788e-01,
        4.25189058e-01, -8.65845395e-01,  1.30471849e-01,  4.75236906e-01,
        1.14438331e+00, -6.67209237e-01,  1.04178893e+00, -3.10067078e-02,
       -1.42575444e+00,  4.27317178e-01,  9.66384139e-01,  8.52262899e-01,
        1.04900521e-01,  7.18953020e-01,  6.10793623e-01, -4.54981803e-01])

In [87]:
quartiles=pd.qcut(data,4,precision=2)

In [88]:
quartiles

[(-0.0021, 0.63], (0.63, 2.86], (-2.8899999999999997, -0.68], (-0.68, -0.0021], (-0.68, -0.0021], ..., (0.63, 2.86], (-0.0021, 0.63], (0.63, 2.86], (-0.0021, 0.63], (-0.68, -0.0021]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.8899999999999997, -0.68] < (-0.68, -0.0021] < (-0.0021, 0.63] < (0.63, 2.86]]

In [89]:
pd.value_counts(quartiles)

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_15812\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-2.8899999999999997, -0.68]    250
(-0.68, -0.0021]                250
(-0.0021, 0.63]                 250
(0.63, 2.86]                    250
Name: count, dtype: int64

In [90]:
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

(-2.885, -1.279]      100
(-1.279, -0.00209]    400
(-0.00209, 1.265]     400
(1.265, 2.862]        100
Name: count, dtype: int64


# Detecting and Filtering Outliers

In [91]:
data=pd.DataFrame(np.random.standard_normal((1000,4)))

In [92]:
data

            0         1         2         3
0    1.306375  0.884125 -1.718732 -0.493724
1   -2.037998 -0.047604 -0.951057 -0.096360
2    0.829827 -0.515405 -0.280152 -1.794366
3   -0.812637  0.080343  0.274540 -1.978524
4   -0.899629 -0.895350 -1.691873  0.821900
..        ...       ...       ...       ...
995 -0.542000 -0.280235  1.044118  1.600900
996 -0.614647 -0.992824 -0.204217 -0.574071
997 -0.303970  3.440370 -0.622323  0.176235
998 -2.466074 -0.206688 -0.043951 -0.108638
999 -0.210735  1.092057 -1.487115  0.152382

[1000 rows x 4 columns]

In [93]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.005181    -0.009208    -0.022848    -0.001619
std       0.990935     1.027777     0.966230     1.011875
min      -3.535306    -3.790290    -2.940027    -3.316629
25%      -0.719862    -0.716032    -0.683629    -0.695518
50%      -0.019453    -0.002004    -0.036381     0.005877
75%       0.654721     0.684557     0.574691     0.680384
max       3.784889     3.440370     2.965389     2.873746

In [94]:
col=data[2]

In [95]:
col

0     -1.718732
1     -0.951057
2     -0.280152
3      0.274540
4     -1.691873
         ...
995    1.044118
996   -0.204217
997   -0.622323
998   -0.043951
999   -1.487115
Name: 2, Length: 1000, dtype: float64

In [96]:
col[col.abs()>3]

Series([], Name: 2, dtype: float64)

In [97]:
data[(data.abs()>3).any(axis="columns")]

            0         1         2         3
11   3.756849 -0.474253  1.042059  1.246510
16   3.784889  2.699173 -1.497224  0.434116
227 -0.361221 -0.276542 -0.240584 -3.077106
237  3.199117  0.665594 -0.855700 -0.590922
336  1.062829  0.020302 -0.956543 -3.265822
466 -0.254360  1.349296 -0.485371 -3.101344
590  1.281145 -3.790290 -1.982314 -0.899860
829 -3.535306  1.264811  1.879343  0.518648
974  1.655772  1.201009 -0.528882 -3.316629
997 -0.303970  3.440370 -0.622323  0.176235

In [98]:
np.sign(data)*3

       0    1    2    3
0    3.0  3.0 -3.0 -3.0
1   -3.0 -3.0 -3.0 -3.0
2    3.0 -3.0 -3.0 -3.0
3   -3.0  3.0  3.0 -3.0
4   -3.0 -3.0 -3.0  3.0
..   ...  ...  ...  ...
995 -3.0 -3.0  3.0  3.0
996 -3.0 -3.0 -3.0 -3.0
997 -3.0  3.0 -3.0  3.0
998 -3.0 -3.0 -3.0 -3.0
999 -3.0  3.0 -3.0  3.0

[1000 rows x 4 columns]

In [99]:
data[data.abs()>3]=np.sign(data)*3

In [100]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.006386    -0.008858    -0.022848    -0.000858
std       0.983235     1.023778     0.966230     1.009522
min      -3.000000    -3.000000    -2.940027    -3.000000
25%      -0.719862    -0.716032    -0.683629    -0.695518
50%      -0.019453    -0.002004    -0.036381     0.005877
75%       0.654721     0.684557     0.574691     0.680384
max       3.000000     3.000000     2.965389     2.873746

In [101]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0 -1.0 -1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0 -1.0 -1.0  1.0

# Permutation and Random Sampling

In [102]:
df=pd.DataFrame(np.arange(5*7).reshape((5,7)))

In [ ]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [104]:
sampler=np.random.permutation(5)

In [105]:
sampler

array([4, 1, 2, 3, 0], dtype=int32)

In [106]:
df.take(sampler)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [107]:
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [108]:
columnn_sampler=np.random.permutation(7)

In [109]:
columnn_sampler

array([5, 2, 6, 0, 1, 4, 3], dtype=int32)

In [110]:
df.take(columnn_sampler,axis="columns")

    5   2   6   0   1   4   3
0   5   2   6   0   1   4   3
1  12   9  13   7   8  11  10
2  19  16  20  14  15  18  17
3  26  23  27  21  22  25  24
4  33  30  34  28  29  32  31

In [112]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [113]:
df.sample(n=3)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

In [114]:
choices=pd.Series([5,7,-1,6,4])

In [116]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [119]:
choices.sample(n=10,replace=True)

1    7
4    4
3    6
2   -1
4    4
4    4
2   -1
4    4
4    4
1    7
dtype: int64

Computing Indicator/Dummy Variables

In [120]:
df=pd.DataFrame({
    "key":list("bbacab"),
    "data1":range(6)
})

In [121]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [122]:
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [146]:
dummies=pd.get_dummies(df["key"],prefix="key")

In [147]:
dummies

   key_a  key_b  key_c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [126]:
df_with_dummy=df[["data1"]].join(dummies)

In [127]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [128]:
mnames = ["movie_id", "title", "genres"]

In [133]:
movies=pd.read_table("datasets/movielens/movies.dat",sep="::",header=None,names=mnames,engine="python")

In [136]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [137]:
dummies=movies["genres"].str.get_dummies("|")

In [141]:
dummies.iloc[:10,:6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [142]:
movies_windic=movies.join(dummies.add_prefix("Genre_"))

In [151]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [152]:
np.random.seed(12345)

In [160]:
values=np.random.uniform(size=10)

In [161]:
values

array([0.74771481, 0.96130674, 0.0083883 , 0.10644438, 0.29870371,
       0.65641118, 0.80981255, 0.87217591, 0.9646476 , 0.72368535])

In [162]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [163]:
pd.cut(values,bins)

[(0.6, 0.8], (0.8, 1.0], (0.0, 0.2], (0.0, 0.2], (0.2, 0.4], (0.6, 0.8], (0.8, 1.0], (0.8, 1.0], (0.8, 1.0], (0.6, 0.8]]
Categories (5, interval[float64, right]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [164]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False        True       False
1       False       False       False       False        True
2        True       False       False       False       False
3        True       False       False       False       False
4       False        True       False       False       False
5       False       False       False        True       False
6       False       False       False       False        True
7       False       False       False       False        True
8       False       False       False       False        True
9       False       False       False        True       False

7.3 Extension Data Types

In [165]:
s=pd.Series([1,2,3,None])

In [166]:
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [167]:
s.dtype

dtype('float64')

In [168]:
s=pd.Series([1,2,3,None],dtype=pd.Int64Dtype())

In [169]:
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [170]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [171]:
s[3]

In [173]:
s[3] is pd.NA

True

In [174]:
s=pd.Series([1,2,3,None],dtype="Int64")

In [175]:
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [176]:
s=pd.Series(["one","two",None,"three"],dtype=pd.StringDtype())

In [177]:
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [178]:
dict={
    "A":[1,2,None,4],
    "B":["one","two","three",None],
    "C":[False,None,False,True]
}

In [179]:
df=pd.DataFrame(dict)

In [180]:
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [181]:
df["A"]=df["A"].astype("Int64")

In [183]:
df["B"]=df["B"].astype("string")

In [185]:
df["C"]=df["C"].astype("boolean")

In [186]:
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

## Table 7-3. pandas extension data types

| Extension type   | Description                                                                 | Example (Python) |
|------------------|-----------------------------------------------------------------------------|------------------|
| `BooleanDtype`   | Nullable Boolean data, use `"boolean"` when passing as string               | `pd.Series([True, False, None], dtype="boolean")` |
| `CategoricalDtype` | Categorical data type, use `"category"` when passing as string            | `pd.Series(["a","b","a"], dtype="category")` |
| `DatetimeTZDtype` | Datetime with time zone                                                    | `pd.Series(pd.date_range("2024-01-01", periods=3, tz="UTC"))` |
| `Float32Dtype`   | 32-bit nullable floating point, use `"Float32"` when passing as string      | `pd.Series([1.0, None, 3.5], dtype="Float32")` |
| `Float64Dtype`   | 64-bit nullable floating point, use `"Float64"` when passing as string      | `pd.Series([1.0, None, 3.5], dtype="Float64")` |
| `Int8Dtype`      | 8-bit nullable signed integer, use `"Int8"` when passing as string          | `pd.Series([1, None, 3], dtype="Int8")` |
| `Int16Dtype`     | 16-bit nullable signed integer, use `"Int16"` when passing as string        | `pd.Series([1, None, 3], dtype="Int16")` |
| `Int32Dtype`     | 32-bit nullable signed integer, use `"Int32"` when passing as string        | `pd.Series([1, None, 3], dtype="Int32")` |
| `Int64Dtype`     | 64-bit nullable signed integer, use `"Int64"` when passing as string        | `pd.Series([1, None, 3], dtype="Int64")` |
| `UInt8Dtype`     | 8-bit nullable unsigned integer, use `"UInt8"` when passing as string       | `pd.Series([1, None, 3], dtype="UInt8")` |
| `UInt16Dtype`    | 16-bit nullable unsigned integer, use `"UInt16"` when passing as string     | `pd.Series([1, None, 3], dtype="UInt16")` |
| `UInt32Dtype`    | 32-bit nullable unsigned integer, use `"UInt32"` when passing as string     | `pd.Series([1, None, 3], dtype="UInt32")` |
| `UInt64Dtype`    | 64-bit nullable unsigned integer, use `"UInt64"` when passing as string     | `pd.Series([1, None, 3], dtype="UInt64")` |

# 7.4 String Manipulation